In [80]:
import pandas as pd

In [81]:
df1 = pd.read_csv(r'Data\LOTR.csv')
df2 = pd.read_csv(r'Data\LOTR 2.csv')
df1

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [82]:
df2

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

### 1. Merging:

In [83]:
df1.merge(df2, on='FellowshipID', how='inner', suffixes=('_1', '_2'))

   FellowshipID FirstName_1     Skills FirstName_2  Age
0          1001       Frodo     Hiding       Frodo   50
1          1002     Samwise  Gardening     Samwise   39

In [84]:
df1.merge(df2, on='FellowshipID', how='outer', sort=True)

   FellowshipID FirstName_x     Skills FirstName_y     Age
0          1001       Frodo     Hiding       Frodo    50.0
1          1002     Samwise  Gardening     Samwise    39.0
2          1003     Gandalf     Spells         NaN     NaN
3          1004      Pippin  Fireworks         NaN     NaN
4          1006         NaN        NaN     Legolas  2931.0
5          1007         NaN        NaN      Elrond  6520.0
6          1008         NaN        NaN    Barromir    51.0

In [85]:
df1.merge(df2, how='cross')

    FellowshipID_x FirstName_x     Skills  FellowshipID_y FirstName_y   Age
0             1001       Frodo     Hiding            1001       Frodo    50
1             1001       Frodo     Hiding            1002     Samwise    39
2             1001       Frodo     Hiding            1006     Legolas  2931
3             1001       Frodo     Hiding            1007      Elrond  6520
4             1001       Frodo     Hiding            1008    Barromir    51
5             1002     Samwise  Gardening            1001       Frodo    50
6             1002     Samwise  Gardening            1002     Samwise    39
7             1002     Samwise  Gardening            1006     Legolas  2931
8             1002     Samwise  Gardening            1007      Elrond  6520
9             1002     Samwise  Gardening            1008    Barromir    51
10            1003     Gandalf     Spells            1001       Frodo    50
11            1003     Gandalf     Spells            1002     Samwise    39
12            1003     Gandalf     Spells            1006     Legolas  2931
13            1003     Gandalf     Spells            1007      Elrond  6520
14            1003     Gandalf     Spells            1008    Barromir    51
15            1004      Pippin  Fireworks            1001       Frodo    50
16            1004      Pippin  Fireworks            1002     Samwise    39
17            1004      Pippin  Fireworks            1006     Legolas  2931
18            1004      Pippin  Fireworks            1007      Elrond  6520
19            1004      Pippin  Fireworks            1008    Barromir    51

### 2. Join():

join() → is more limited, designed mainly for joining on index.
<p style='color:#ff0000' background:'#ffffffff'>You cannot use on='col' directly in join() the way you do in merge().</p>
✅ If you want to use join on a column You need to set that column as an index first: <span style='color:green'>df1 = df1.set_index("col")</span>

In [86]:
df4 = df1.set_index('FellowshipID')
df5 = df2.set_index('FellowshipID')
df4.join(df5, on='FellowshipID', how='inner', lsuffix='_1', rsuffix='_2')

             FirstName_1     Skills FirstName_2  Age
FellowshipID
1001               Frodo     Hiding       Frodo   50
1002             Samwise  Gardening     Samwise   39

### 3. Concat():

#### Row Concatenation

In [113]:
pd.concat([df1, df2])

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding     NaN
1          1002   Samwise  Gardening     NaN
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
0          1001     Frodo        NaN    50.0
1          1002   Samwise        NaN    39.0
2          1006   Legolas        NaN  2931.0
3          1007    Elrond        NaN  6520.0
4          1008  Barromir        NaN    51.0

In [114]:
pd.concat([df1, df2], join='inner')

   FellowshipID FirstName
0          1001     Frodo
1          1002   Samwise
2          1003   Gandalf
3          1004    Pippin
0          1001     Frodo
1          1002   Samwise
2          1006   Legolas
3          1007    Elrond
4          1008  Barromir

#### Column Concatenation

In [111]:
pd.concat([df2, df1['Skills'].loc[df1['FellowshipID'].isin(df2['FellowshipID'])]], axis=1)

   FellowshipID FirstName   Age     Skills
0          1001     Frodo    50     Hiding
1          1002   Samwise    39  Gardening
2          1006   Legolas  2931        NaN
3          1007    Elrond  6520        NaN
4          1008  Barromir    51        NaN